Tekla Open API Reference for Tekla Structures 2025
Projection Class
 The Projection class contains methods for calculating the projection of geometric objects on other geometric objects.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Geometry3d.Projection
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public static class Projection
<SerializableAttribute>
Public NotInheritable Class Projection
The Projection type exposes the following members.
Methods
Name | Description
LineSegmentToPlane
 Returns a new line segment which is a projection of the given line segment onto the given plane.
LineToPlane
 Returns a new line which is a projection of the given line onto the given plane.
PointToLine
 Returns a new point which is a projection of the given point onto the given line.
PointToPlane
 Returns a new point which is a projection of the given point onto the given plane.
Top
See Also
Reference
Tekla.Structures.Geometry3d Namespace